For Revit Macros internal use only.
  Namespace:   Autodesk.Revit.DB.Macros
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public void OnShutdownEO()
  Visual Basic
Public Sub OnShutdownEO
  Visual C++
public:
virtual void OnShutdownEO() sealed
 Implements
  IEntryPoint OnShutdown
 See Also
  ApplicationEntryPoint Class
  Autodesk.Revit.DB.Macros Namespace